<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-pandas-and-load-the-NLS-data" data-toc-modified-id="Import-pandas-and-load-the-NLS-data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas and load the NLS data</a></span></li><li><span><a href="#View-some-of-the-weeks-worked-and-college-enrollment-data" data-toc-modified-id="View-some-of-the-weeks-worked-and-college-enrollment-data-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>View some of the weeks worked and college enrollment data</a></span></li><li><span><a href="#Run-the-wide_to_long-function" data-toc-modified-id="Run-the-wide_to_long-function-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Run the wide_to_long function</a></span></li></ul></div>

# Import pandas and load the NLS data

In [1]:
import pandas as pd

In [2]:
# pd.set_option('display.width', 200)
# pd.set_option('display.max_columns', 30)
# pd.set_option('display.max_rows', 200)
# pd.options.display.float_format = '{:,.0f}'.format

In [3]:
import watermark
%load_ext watermark

%watermark -n -i -iv

pandas   : 1.2.1
watermark: 2.1.0
json     : 2.0.9

In [4]:
nls97 = pd.read_csv('data/nls97f.csv')

In [5]:
nls97.set_index('personid', inplace=True)

# View some of the weeks worked and college enrollment data

In [6]:
weeksworkedcols = [
    'weeksworked00', 'weeksworked01', 'weeksworked02', 'weeksworked03',
    'weeksworked04'
]

In [7]:
colenrcols = [
    'colenroct00', 'colenroct01', 'colenroct02', 'colenroct03', 'colenroct04'
]

In [8]:
nls97.loc[nls97['originalid'].isin([1, 2]),
          ['originalid'] + weeksworkedcols + colenrcols].T

personid                  135335              999406
originalid                     1                   2
weeksworked00               53.0                51.0
weeksworked01               52.0                52.0
weeksworked02                NaN                44.0
weeksworked03               42.0                45.0
weeksworked04               52.0                52.0
colenroct00    3. 4-year college   3. 4-year college
colenroct01    3. 4-year college  2. 2-year college
colenroct02    3. 4-year college   3. 4-year college
colenroct03      1. Not enrolled   3. 4-year college
colenroct04      1. Not enrolled   3. 4-year college

# Run the wide_to_long function

In [9]:
workschool = pd.wide_to_long(nls97[['originalid'] + weeksworkedcols +
                                   colenrcols],
                             stubnames=['weeksworked', 'colenroct'],
                             i=['originalid'],
                             j='year').reset_index()

In [10]:
workschool.head(2)

   originalid  year  weeksworked        colenroct
0        8245     0         46.0  1. Not enrolled
1        3962     0          5.0  1. Not enrolled

In [11]:
workschool['year'] = workschool['year'] + 2000

In [12]:
workschool = workschool.sort_values(['originalid', 'year'])

In [13]:
workschool.set_index(['originalid'], inplace=True)

In [14]:
# wide_to_long accomplishes in one step what it took us several steps to accomplish in
# the previous recipe using melt

workschool.head(10)

            year  weeksworked           colenroct
originalid
1           2000         53.0   3. 4-year college
1           2001         52.0   3. 4-year college
1           2002          NaN   3. 4-year college
1           2003         42.0     1. Not enrolled
1           2004         52.0     1. Not enrolled
2           2000         51.0   3. 4-year college
2           2001         52.0  2. 2-year college
2           2002         44.0   3. 4-year college
2           2003         45.0   3. 4-year college
2           2004         52.0   3. 4-year college

In [21]:
weeksworkedcols = [
    'weeksworked00', 'weeksworked01', 'weeksworked02', 'weeksworked04',
    'weeksworked05'
]

In [22]:
workschool = pd.wide_to_long(nls97[['originalid'] + weeksworkedcols +
                                   colenrcols],
                             stubnames=['weeksworked', 'colenroct'],
                             i=['originalid'],
                             j='year').reset_index()

In [23]:
workschool['year'] = workschool['year'] + 2000

In [24]:
workschool = workschool.sort_values(['originalid', 'year'])

In [25]:
workschool.set_index(['originalid'], inplace=True)

In [26]:
workschool.head(12)

            year  weeksworked           colenroct
originalid
1           2000         53.0   3. 4-year college
1           2001         52.0   3. 4-year college
1           2002          NaN   3. 4-year college
1           2003          NaN     1. Not enrolled
1           2004         52.0     1. Not enrolled
1           2005         53.0                 NaN
2           2000         51.0   3. 4-year college
2           2001         52.0  2. 2-year college
2           2002         44.0   3. 4-year college
2           2003          NaN   3. 4-year college
2           2004         52.0   3. 4-year college
2           2005         53.0                 NaN